---
kind: other
id: Methods.T:Autodesk.Revit.DB.FilterDoubleRule
source: html/e72f182d-0e8b-9718-e6b6-09387f44c23d.htm
---
# FilterDoubleRule Methods

Derived classes override this method to implement the test that determines
 whether the given element passes this rule or not.